import {} from "../types"; // Using path alias '@/' for 'src/'
export const products = [
    {
        imgSrc: "/intensive_repair.webp",
        title: "شامپو و نرم کننده داو مناسب ترمیم موهای آسیب‌دیده (INTENSIVE REPAIR)",
        description: "مناسب موهای خشک و آسیب‌دیده\nدارای تکنولوژی ترمیم هدفمند\nتا ۹۰٪ جلوگیری از آسیب مو و ترمیم موهای آسیب‌دیده\nحاوی گلوکونولاکتون",
        hoverTitle: "مناسب موهای خشک و آسیب‌دیده",
        hoverDesc: "با تکنولوژی ترمیم هدفمند، موهای آسیب‌دیده را هدف قرار می‌دهد و مانند آهن‌ربا روی قسمت‌های آسیب‌دیده باقی می‌ماند تا آسیب‌های شدید ناشی از فرم دادن به موها، رنگ و ... را ترمیم کند.",
        hoverTextColor: "#113274"
    },
    {
        imgSrc: "/daily_moisture.webp",
        title: "شامپو و نرم کننده داو مناسب برای شستشو روزانه موها (DAILY MOISTURE)",
        description: "مناسب انواع موها\nدارای کمپلکس PRO-MOISTURE\nرطوبت رسانی به پوست سر، احیا رطوبت ساقه‌ی مو\nحاوی گلیسیرین",
        hoverTitle: "مناسب انواع موها",
        hoverDesc: "این شامپو هماهنگ با سطح تار موها عمل می‌کند تا موها از عمق تغذیه شوند و به استحکام و مرطوب ماندن موها کمک ‌کند.",
        hoverTextColor: "#008999"
    },
    {
        imgSrc: "/color_vibrancy.webp",
        title: "شامپو و نرم‌کننده مناسب موهای رنگ شده (COLOR VIBRANCY)",
        description: "مناسب موهای رنگ‌شده\nدارای تکنولوژی تثبیت رنگ\nتا ۹۰٪ جلوگیری از آسیب ناشی از رنگ شدگی مو\nحاوی لایزین",
        hoverTitle: "مناسب موهای رنگ شده",
        hoverDesc: "با تکنولوژی تثبیت رنگ مو، از موهای رنگ‌شده محافظت کرده و آسیب‌ها را ترمیم می‌کند و باعث درخشندگی و طراوت موها می‌شود. فرمول مورد استفاده در این محصول سریعاً موها را از عمق تغذیه می‌کند.",
        hoverTextColor: "#D95D7E"
    },
    {
        imgSrc: "/hair_fail_rescue.webp",
        title: "شامپو داو، تقویت کننده موهای شکننده (HAIR FALL RESCUE)",
        description: "مناسب موهای ضعیف و شکننده\nبا قدرت ترمیم موها در بلند مدت\nتا ۴ برابر ساقه‌ی موهایی قوی‌تر\nحاوی سرامید",
        hoverTitle: "مناسب موهای ضعیف و شکننده",
        hoverDesc: "شامپوی تقویت‌کننده‌ی موی داو با قدرت ترمیم موها در بلندمدت، فوراً کوتیکول‌ها را محاصره کرده و با تقویت موها ضمن جلوگیری از ریزش، باعث بهتر شدن رشد طبیعی موها می‌شود.",
        hoverTextColor: "#0F852F"
    },
    {
        imgSrc: "/purifying.webp",
        title: "شامپو داو، مناسب موهای چرب (PURIFYING)",
        description: "مناسب موهای چرب\nدارای تکنولوژی هیدرالیفت\nاحیای تمیزی پوست و مو سر\nتشکیل شده از ۹۰٪ مواد طبیعی",
        hoverTitle: "مناسب موهای چرب",
        hoverDesc: "-این شامپو به موهای شما کمک می‌کند تا تعادل طبیعی خود را حفظ کند و نرم و انعطاف‌پذیر باشد.",
        hoverTextColor: "#EA8A07"
    },
    {
        imgSrc: "/shea_butter_&_warm_vanilla_scent.webp",
        title: "SHEA BUTTER & WARM VANILLA SCENT",
        description: "مایع دستشویی داو  با رایحه شی باتر و وانیل",
        hoverTitle: "مایع دستشویی داو  با رایحه شی باتر و وانیل",
        hoverDesc: "این محصول، با ترکیب شی باتر و رایحه دل‌انگیز وانیل، ابری از کف کرمی و غنی می‌آفریند که دستان شما را نوازش کرده و لطافتی بی‌مثال به آن‌ها می‌بخشد.",
        hoverTextColor: "#9E553A"
    },
    {
        imgSrc: "/deeply_nourishing.webp",
        title: "DEEPLY NOURISHING",
        description: "مایع دستشویی رطوبت رسان داو",
        hoverTitle: "مایع دستشویی رطوبت رسان داو",
        hoverDesc: "با فرمولاسیون لطیف و ملایم، غنی‌شده به یک‌چهارم کرم مرطوب‌کننده که با هر بار شست‌وشو دستان شما را نرم و لطیف می‌کند.",
        hoverTextColor: "#07255B"
    },
    {
        imgSrc: "/cucumber_&_green_tea_scent.webp",
        title: "CUCUMBER & GREEN TEA SCENT",
        description: "مایع دستشویی داو با رایحه‌ی خیار و چای سبز",
        hoverTitle: "مایع دستشویی داو با رایحه‌ی خیار و چای سبز",
        hoverDesc: "این محصول با ترکیبی دلنشین از خیار و چای سبز، حس تازگی و سرزندگی را به دستان شما هدیه می‌دهد. به گونه‌ای که دستانتان نرم و لطیف می‌شود.",
        hoverTextColor: "#4A992C"
    },
    {
        imgSrc: "/deeply_nourishing_xl.webp",
        title: "DEEPLY NOURISHING",
        description: "مایع دستشویی رطوبت رسان داو",
        hoverTitle: "مایع دستشویی رطوبت رسان داو",
        hoverDesc: "با فرمولاسیون لطیف و ملایم، غنی‌شده به یک‌چهارم کرم مرطوب‌کننده که با هر بار شست‌وشو دستان شما را نرم و لطیف می‌کند.",
        hoverTextColor: "#07255B"
    },
];
