import {type Product} from "../types";  // Using path alias '@/' for 'src/'

export const products: Product[] = [
    {
        imgSrc: "/intensive_repair.jpg",
        title: "INTENSIVE REPAIR",
        description: "شامپو و نرم‌کننده مناسب موهای خشک و آسیب دیده\n" +
            "تا ۹۰%  جلوگیری از آسیب مو و ترمیم موهای آسیب دیده\n" +
            "حاوی گلوکونولاکتون",
        hoverTitle: "مناسب موهای خشک و آسیب دیده",
        hoverDesc: "با تکنولوژی ترمیم هدفمند به بازسازی مــوهــا از ساقــه مو کمــک کــرده تا در بلــندمدت جلــوه‌ای ســلامت و پرنشــاط داشته باشند.",
        hoverTextColor: "#113274"
    },
    {
        imgSrc: "/daily_moisture.jpg",
        title: "DAILY MOISTURE",
        description: "شامپو و نرم‌کننده‌ای مناسب انواع موها\n" +
            "رطوبت رسانی به پوست سر، احیا رطوبت ساقه‌ی مو\n" +
            "حاوی گلیسیرین",
        hoverTitle: "مناسب انواع موها",
        hoverDesc: "معجون مرطوب‌کننده حرفه‌ای پرو مویسچر که مو را از درون ساقه سرشار می‌سازد و آن را مرطوب و مقاوم می‌کند تا جلوه پر نشاط موها را در بلندمدت نگه دارد.",
        hoverTextColor: "#008999"
    },
    {
        imgSrc: "/color_vibrancy.jpg",
        title: "COLOR VIBRANCY",
        description: "شامپو و نرم‌کننده‌ای برای موهای رنگ شده\n" +
            "تا ۹۰% جلوگیری از آسیب مو ناشی از رنگ شدگی مو\n" +
            "حاوی لایزین",
        hoverTitle: "مناسب موهای رنگ شده",
        hoverDesc: "دارای تکنولوژی تثبیت رنگ. از موهای آسیب‌دیده و رنگ شده مراقبت می‌کند و سرزندگی و درخشش را به موها باز می‌گرداند.",
        hoverTextColor: "#D95D7E"
    },
    {
        imgSrc: "/hair_fail_rescue.jpg",
        title: "HAIR FAIL RESCUE",
        description: "شامپوی موهای بلند و سست\n" +
            "تا ۴ برابر ساقه‌ی موهایی قوی تر \n" +
            "حاوی سرامید",
        hoverTitle: "مناسب موهای ضعیف و شکننده",
        hoverDesc: "با قدرت ترمیم موها در بلند تارهای مو را عمیقا مستحکم می‌سازد و مقاومتشان را در برابر موخوره افزایش می‌دهد. این شامپو با تقویت مو  ریزش ساقه را متوقف می‌کند.",
        hoverTextColor: "#0F852F"
    },
    {
        imgSrc: "/purifying.jpg",
        title: "PURIFYING",
        description: "شامپوی موهای چرب\n" +
            "احیای تمیزی پوست و مو سر\n" +
            "تشکیل شده از ۹۰% مواد طبیعی",
        hoverTitle: "مناسب موهای چرب",
        hoverDesc: "با تکنولوژی هیدرالیفت به موهای شما کمک می‌کند تا تعادل طبیعی را حفظ کنند. پس از هربار استفاده از این شامپو موهای شما سبک نرم و زیبا خواهند بود.",
        hoverTextColor: "#EA8A07"
    },
    {
        imgSrc: "/shea_butter_&_warm_vanilla_scent.jpg",
        title: "SHEA BUTTER & WARM VANILLA SCENT",
        description: "غنی شده با شی باتر و رایحه ی وانیل گرم",
        hoverTitle: "مناسب موهای چرب",
        hoverDesc: "معجون هیدرالیفت به موهای شما کمک می‌کند تعادل طبیعی  نرم و سبک خود را حفظ کنند. پس از هربار استفاده از این شامپو موهای شما سبک درخشان و زیبا خواهند بود.",
        hoverTextColor: "#9E553A"
    },
    {
        imgSrc: "/deeply_nourishing.jpg",
        title: "deeply nourishing",
        description: "رطوبت‌رسان عمیق\n" +
            "با فرمولاسیون لطیف\n" +
            "غنی‌شده به یک‌چهارم کرم مرطوب‌کننده",
        hoverTitle: "مناسب موهای سست و شکننده",
        hoverDesc: "مرهم موهای بلند تارهای مو را عمیقا سرشار و مستحکم می‌سازد و مقاومتشان را در برابر موخوره افزایش می‌دهد. این شامپو با تقویت مو  ریزش را متوقف کرده و رشد طبیعی زلف بلند را تقویت می‌کند.",
        hoverTextColor: "#07255B"
    },
    {
        imgSrc: "/cucumber_&_green_tea_scent.jpg",
        title: "CUCUMBER & GREEN TEA SCENT",
        description: "دارای رایحه ی خنک خیار و چای سبز",
        hoverTitle: "مناسب موهای آسیب دیده",
        hoverDesc: "مرهم بازتوانی رشته‌های مو که مغز آنها را عمیقا سرشار می‌سازد و بازسازی را از درون ساقه مو آغاز می‌کند تا در بلندمدت جلوه‌ای سلامت و پرنشاط داشته باشند.",
        hoverTextColor: "#4A992C"
    },
    {
        imgSrc: "/deeply nourishing_xl.jpg",
        title: "DEEPLY NOURISHING",
        description: "شامپوی موهای بلند و سست\n" +
            "تا 4 برابر ساقه‌ی موهایی قوی تر حاوی سرامید",
        hoverTitle: "مناسب موهای سست و شکننده",
        hoverDesc: "مرهم موهای بلند تارهای مو را عمیقا سرشار و مستحکم می‌سازد و مقاومتشان را در برابر موخوره افزایش می‌دهد. این شامپو با تقویت مو  ریزش را متوقف کرده و رشد طبیعی زلف بلند را تقویت می‌کند.",
        hoverTextColor: "#07255B"
    },
];